# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iMTkxZTU1Ni0wODc4LTQzYzAtOTNiNS0xMjhhNWJmMWQ2OTk7b2JqZWN0SWQ9NjlhM2I0ZjgtYTExOS00NzM0LTk2NTgtZmNiZjdjNjM4M2U2O3N1YnNjcmlwdGlvbklkPTBmMDVlOWQ0LTU5MmItNDkxYS1iOWRhLTQ5YThiMjQyZDBjNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_role_assignment.sb_authz_ra will be created
  + resource "azurerm_role_assignment" "sb_authz_ra" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "043fda61-fcda-45e3-8a35-623de22c3b4d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.sb_feedpoller_ra will be created
  + resource "azurerm_role_assignment" "sb_feedpoller_ra" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3f286d65-93fe-4561-8501-4a304be20da2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_servicebus_namespace.dd_sb_ns will be created
  + resource "azurerm_servicebus_namespace" "dd_sb_ns" {
      + capacity                            = 0
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + local_auth_enabled                  = true
      + location                            = "norwayeast"
      + minimum_tls_version                 = "1.2"
      + name                                = "dd-prod-sbn"
      + premium_messaging_partitions        = 0
      + public_network_access_enabled       = true
      + resource_group_name                 = "altinn-digdir-oed-rg"
      + sku                                 = "Standard"
      + tags                                = {
          + "costcenter" = "altinn3"
          + "solution"   = "apps"
        }

      + network_rule_set (known after apply)
    }

  # azurerm_windows_function_app.feedpoller will be updated in-place
  ~ resource "azurerm_windows_function_app" "feedpoller" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.Web/sites/oed-feedpoller-func"
        name                                           = "oed-feedpoller-func"
        tags                                           = {
            "costcenter"                                     = "altinn3"
            "hidden-link: /app-insights-conn-string"         = (sensitive value)
            "hidden-link: /app-insights-instrumentation-key" = (sensitive value)
            "solution"                                       = "apps"
        }
        # (33 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @kurt70 |
| Action | `push` |
| Working Directory | `./infra/altinn-digdir-oed-rg` |
| State File | `github.com/altinn/dd-infrastructure/environments/prod/altinn-digdir-oed-rg.tfstate` |
| Plan File | `github.com_altinn_dd-infrastructure_environments_prod_altinn-digdir-oed-rg.tfstate.tfplan`